testing/archive/load_test_4_24_2025__5_00_51_pm.log
2025-04-24 17:00:51,333 - Test start time: 4_24_2025__5_00_51_pm
2025-04-24 17:00:51,634 - Test Started: 19:0 rate: 10 pods: 5
2025-04-24 17:01:51,930 - WRK2 Output:
Running 1m test @ http://128.105.146.155/
  1 threads and 8 connections
  Thread calibration: mean lat.: 254.069ms, rate sampling interval: 1756ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    68.52ms  136.87ms 979.97ms   95.37%
    Req/Sec     9.68      1.28    13.00     89.29%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   21.69ms
 75.000%   76.10ms
 90.000%  161.41ms
 99.000%  882.17ms
 99.900%  980.48ms
 99.990%  980.48ms
 99.999%  980.48ms
100.000%  980.48ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       2.749     0.000000            1         1.00
       4.547     0.100000           50         1.11
       6.179     0.200000          100         1.25
       8.247     0.300000          150         1.43
      11.735     0.400000          199         1.67
      21.695     0.500000          249         2.00
      32.799     0.550000          274         2.22
      52.863     0.600000          299         2.50
      61.183     0.650000          324         2.86
      68.671     0.700000          348         3.33
      76.095     0.750000          373         4.00
      81.343     0.775000          386         4.44
      85.823     0.800000          398         5.00
      90.687     0.825000          411         5.71
     119.231     0.850000          423         6.67
     135.423     0.875000          435         8.00
     157.951     0.887500          442         8.89
     162.047     0.900000          448        10.00
     167.935     0.912500          455        11.43
     172.799     0.925000          460        13.33
     179.199     0.937500          466        16.00
     184.191     0.943750          470        17.78
     185.983     0.950000          473        20.00
     227.199     0.956250          476        22.86
     258.303     0.962500          479        26.67
     265.215     0.968750          482        32.00
     268.799     0.971875          485        35.56
     268.799     0.975000          485        40.00
     801.791     0.978125          487        45.71
     824.319     0.981250          488        53.33
     872.959     0.984375          490        64.00
     875.007     0.985938          491        71.11
     875.007     0.987500          491        80.00
     882.175     0.989062          492        91.43
     883.199     0.990625          493       106.67
     934.399     0.992188          494       128.00
     934.399     0.992969          494       142.22
     934.399     0.993750          494       160.00
     935.423     0.994531          495       182.86
     935.423     0.995313          495       213.33
     976.895     0.996094          496       256.00
     976.895     0.996484          496       284.44
     976.895     0.996875          496       320.00
     976.895     0.997266          496       365.71
     976.895     0.997656          496       426.67
     980.479     0.998047          497       512.00
     980.479     1.000000          497          inf
#[Mean    =       68.521, StdDeviation   =      136.875]
#[Max     =      979.968, Total count    =          497]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  601 requests in 1.00m, 7.61MB read
Requests/sec:     10.02
Transfer/sec:    129.83KB

2025-04-24 17:01:52,234 - Test completed: wrk2 -t1 -c8 -d60s -R10 --latency http://128.105.146.155/
2025-04-24 17:01:52,530 - Test Started: 19:1 rate: 11 pods: 3