testing/archive/load_test_4_24_2025__5_02_35_pm.log
2025-04-24 17:02:35,601 - Test start time: 4_24_2025__5_02_35_pm
2025-04-24 17:02:35,892 - Test Started: 19:2 rate: 10 pods: 3
2025-04-24 17:03:36,211 - WRK2 Output:
Running 1m test @ http://128.105.146.155/
  1 threads and 8 connections
  Thread calibration: mean lat.: 157.356ms, rate sampling interval: 1586ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    56.28ms   62.50ms 297.22ms   85.89%
    Req/Sec     9.71      0.81    11.00     96.77%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   22.37ms
 75.000%   89.21ms
 90.000%  171.90ms
 99.000%  272.38ms
 99.900%  297.47ms
 99.990%  297.47ms
 99.999%  297.47ms
100.000%  297.47ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       2.405     0.000000            1         1.00
       4.527     0.100000           51         1.11
       6.255     0.200000          100         1.25
       8.599     0.300000          149         1.43
      11.127     0.400000          199         1.67
      22.367     0.500000          248         2.00
      44.671     0.550000          273         2.22
      54.239     0.600000          298         2.50
      77.823     0.650000          324         2.86
      83.007     0.700000          348         3.33
      89.215     0.750000          372         4.00
      92.863     0.775000          385         4.44
      96.831     0.800000          397         5.00
     100.415     0.825000          410         5.71
     107.455     0.850000          422         6.67
     141.311     0.875000          434         8.00
     146.815     0.887500          441         8.89
     171.903     0.900000          447        10.00
     173.951     0.912500          453        11.43
     177.407     0.925000          460        13.33
     181.503     0.937500          465        16.00
     183.807     0.943750          469        17.78
     185.727     0.950000          472        20.00
     188.671     0.956250          475        22.86
     190.335     0.962500          478        26.67
     191.103     0.968750          481        32.00
     191.743     0.971875          483        35.56
     191.999     0.975000          484        40.00
     193.151     0.978125          486        45.71
     195.199     0.981250          487        53.33
     203.263     0.984375          489        64.00
     247.551     0.985938          490        71.11
     247.551     0.987500          490        80.00
     272.383     0.989062          491        91.43
     272.639     0.990625          492       106.67
     277.759     0.992188          493       128.00
     277.759     0.992969          493       142.22
     277.759     0.993750          493       160.00
     287.743     0.994531          494       182.86
     287.743     0.995313          494       213.33
     293.119     0.996094          495       256.00
     293.119     0.996484          495       284.44
     293.119     0.996875          495       320.00
     293.119     0.997266          495       365.71
     293.119     0.997656          495       426.67
     297.471     0.998047          496       512.00
     297.471     1.000000          496          inf
#[Mean    =       56.278, StdDeviation   =       62.496]
#[Max     =      297.216, Total count    =          496]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  601 requests in 1.00m, 7.50MB read
Requests/sec:     10.02
Transfer/sec:    128.02KB

2025-04-24 17:03:36,536 - Test completed: wrk2 -t1 -c8 -d60s -R10 --latency http://128.105.146.155/
2025-04-24 17:03:36,824 - Test Started: 19:3 rate: 11 pods: 3
2025-04-24 17:04:37,157 - WRK2 Output:
Running 1m test @ http://128.105.146.155/
  1 threads and 8 connections
  Thread calibration: mean lat.: 191.590ms, rate sampling interval: 1540ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    41.90ms   53.18ms 291.33ms   85.69%
    Req/Sec    10.59      0.93    13.00     93.75%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   13.44ms
 75.000%   59.71ms
 90.000%  123.78ms
 99.000%  208.77ms
 99.900%  282.11ms
 99.990%  291.58ms
 99.999%  291.58ms
100.000%  291.58ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       2.711     0.000000            1         1.00
       4.383     0.100000           56         1.11
       5.335     0.200000          111         1.25
       7.175     0.300000          166         1.43
       9.759     0.400000          221         1.67
      13.439     0.500000          276         2.00
      18.687     0.550000          304         2.22
      26.975     0.600000          332         2.50
      35.999     0.650000          359         2.86
      50.847     0.700000          387         3.33
      59.711     0.750000          414         4.00
      68.543     0.775000          428         4.44
      74.239     0.800000          442         5.00
      85.311     0.825000          456         5.71
      92.415     0.850000          470         6.67
     105.471     0.875000          483         8.00
     111.103     0.887500          490         8.89
     123.775     0.900000          497        10.00
     134.143     0.912500          504        11.43
     144.127     0.925000          511        13.33
     154.111     0.937500          518        16.00
     161.535     0.943750          521        17.78
     169.087     0.950000          525        20.00
     171.903     0.956250          528        22.86
     177.791     0.962500          532        26.67
     181.759     0.968750          535        32.00
     185.343     0.971875          537        35.56
     187.007     0.975000          539        40.00
     188.415     0.978125          540        45.71
     194.047     0.981250          542        53.33
     197.503     0.984375          544        64.00
     207.999     0.985938          545        71.11
     208.767     0.987500          546        80.00
     208.767     0.989062          546        91.43
     214.015     0.990625          547       106.67
     223.231     0.992188          548       128.00
     226.303     0.992969          549       142.22
     226.303     0.993750          549       160.00
     226.303     0.994531          549       182.86
     268.031     0.995313          550       213.33
     268.031     0.996094          550       256.00
     282.111     0.996484          551       284.44
     282.111     0.996875          551       320.00
     282.111     0.997266          551       365.71
     282.111     0.997656          551       426.67
     282.111     0.998047          551       512.00
     291.583     0.998242          552       568.89
     291.583     1.000000          552          inf
#[Mean    =       41.904, StdDeviation   =       53.176]
#[Max     =      291.328, Total count    =          552]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  664 requests in 1.00m, 8.04MB read
Requests/sec:     11.06
Transfer/sec:    137.11KB

2025-04-24 17:04:37,460 - Test completed: wrk2 -t1 -c8 -d60s -R11 --latency http://128.105.146.155/
2025-04-24 17:04:37,743 - Test Started: 19:4 rate: 12 pods: 3